Revit 2027 API
ParameterTypeId.ElementLockedParam Property
 "Locked"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId ElementLockedParam { get; }
Public Shared ReadOnly Property ElementLockedParam As ForgeTypeId
	Get
public:
static property ForgeTypeId^ ElementLockedParam {
	ForgeTypeId^ get ();
}
static member ElementLockedParam : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace